doc/Dependencies.plantuml
@startuml

title Shows dependencies between layers according to [[https://www.c-sharpcorner.com/article/what-is-clean-architecture/ Clean Architecture]]

[Application] as Application
[Domain] as Domain
[Infrastructure] as Infrastructure

Application --> Domain
Infrastructure --> Domain
Infrastructure --> Application

Domain -[hidden]down- Infrastructure

@enduml
